__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input1 (InputLayer)             (None, 7)            0                                            
__________________________________________________________________________________________________
input2 (InputLayer)             (None, 7)            0                                            
__________________________________________________________________________________________________
input3 (InputLayer)             (None, 7)            0                                            
__________________________________________________________________________________________________
input4 (InputLayer)             (None, 7)            0                                            
__________________________________________________________________________________________________
input5 (InputLayer)             (None, 7)            0                                            
__________________________________________________________________________________________________
input6 (InputLayer)             (None, 7)            0                                            
__________________________________________________________________________________________________
input7 (InputLayer)             (None, 7)            0                                            
__________________________________________________________________________________________________
input8 (InputLayer)             (None, 7)            0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 3)            24          input1[0][0]                     
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 3)            24          input2[0][0]                     
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 3)            24          input3[0][0]                     
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 3)            24          input4[0][0]                     
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 3)            24          input5[0][0]                     
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 3)            24          input6[0][0]                     
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 3)            24          input7[0][0]                     
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 3)            24          input8[0][0]                     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 24)           0           dense_1[0][0]                    
                                                                 dense_2[0][0]                    
                                                                 dense_3[0][0]                    
                                                                 dense_4[0][0]                    
                                                                 dense_5[0][0]                    
                                                                 dense_6[0][0]                    
                                                                 dense_7[0][0]                    
                                                                 dense_8[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 32)           800         concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 64)           2112        dense_9[0][0]                    
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 64)           4160        dense_10[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 64)           0           dense_11[0][0]                   
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 2)            130         dropout_1[0][0]                  
==================================================================================================
Total params: 7,394
Trainable params: 7,394
Non-trainable params: 0
__________________________________________________________________________________________________
